app/controllers/bils_controller.rb

  def get_bils_list
    @bils_list = Bil.joins("inner join employees on bils.employee_id = employees.id").select("employees.first_name","claim_for","amount").all
---
SELECT employees.first_name, "bils"."claim_for", "bils"."amount" FROM "bils" inner join employees on bils.employee_id = employees.id

  def new
    @bils_list = Bil.new
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    bil_data = params[:bil]
    employee_id = params["employee_id"]
    claim_for = params["expense_category"]
    amount = bil_data["amount"]
    expense_date = bil_data["expense_date"]
    @bils = Bil.new(:employee_id => employee_id, :claim_for => claim_for, :amount => amount, :expense_date => expense_date)
    if @bils.save
---
INSERT INTO "bils" ("amount", "claim_for", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 5000], ["claim_for", "Food"], ["employee_id", 2], ["created_at", "2023-07-13 12:09:03.258931"], ["updated_at", "2023-07-13 12:09:03.258931"]]