app/controllers/employees_controller.rb

SELECT "employees"."first_name", "employees"."designation", departments.dept_name FROM "employees" inner join departments on employees.dept_id = departments.id
---
    def employee_details
        @employees = Employee.joins("inner join departments on employees.dept_id = departments.id").select("first_name","designation","departments.dept_name").all

SELECT "departments".* FROM "departments"
---
    def new
        @departments = Department.all

INSERT INTO "employees" ("first_name", "last_name", "email_address", "designation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", ""], ["last_name", ""], ["email_address", ""], ["designation", ""], ["created_at", "2023-07-16 08:54:00.215286"], ["updated_at", "2023-07-16 08:54:00.215286"]]
---
    def create
        @employee = Employee.new(:first_name => params[:first_name], :last_name => params[:last_name], :dept_id => params[:dept_id], :email_address => params[:email_address], :designation => params[:designation])
        if @employee.save